Documents/Рейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Рейс</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиПоставщику</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияОтПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЛокальногоФормированияЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставкиЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВернутьМногооборотнуюТару</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПорядокРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЗапасов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаУчетаНаборов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНаборов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаАвтоматическойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Рейс/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПочтаПоставщика()
	Возврат Константы.АдресПочтыПоставщика.Получить();
КонецФункции

&НаКлиенте
Процедура ОтпавитьДокументы(Команда)
	
	Если ЗначениеЗаполнено(Объект.ДатаОтправкиПоставщику) Тогда
		Сообщить("Уже отправлено: " + Формат(Объект.ДатаОтправкиПоставщику, "ДЛФ=DD.MM.YYYY HH:MM"));
		Возврат;
	КонецЕсли;
	Если Объект.Заказы.Количество() = 0 Тогда
		Сообщить("В рейсе нет заказов.");
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Модифицированность Тогда
		Сообщить("Данный рейс изменен. Сначала запишите изменения, а после выполните формирование.");
		Возврат;
	КонецЕсли;
	
	
	Попытка
		ПолноеИмяФайла = СформироватьExcelИОтправитьSMTP(Объект.Ссылка, ПочтаПоставщика());
	Исключение
		Сообщить("Ошибка отправки: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Объект.ДатаОтправкиПоставщику = ТекущаяДата();
	Объект.ДатаЛокальногоФормированияЗаявки = Дата(1, 1, 1);
	ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	Сообщить("Отправлено. Файл: " + ПолноеИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаявкуБезОтправки(Команда)
	
	Если Объект.Заказы.Количество() = 0 Тогда
		Сообщить("В рейсе нет заказов.");
		Возврат;
	КонецЕсли;
	Если ЭтотОбъект.Модифицированность Тогда
		Сообщить("Сначала запишите рейс.");
		Возврат;
	КонецЕсли;
	Попытка
		ПолныйПуть = СформироватьЗаявкуБезОтправкиНаСервере(Объект.Ссылка);
		Сообщить(НСтр("ru = 'Заявка сформирована, поставщику не отправлялось. Файл: '") + ПолныйПуть);
		ЭтотОбъект.Прочитать();
	Исключение
		Сообщить(НСтр("ru = 'Ошибка: '") + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьФайлExcelПоРейсу(СсылкаРейса) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка.Организация.Наименование КАК Организация,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.Наименование КАК Родитель,
	|	ЗаказКлиентаТовары.Номенклатура.Код КАК НоменклатураКод,
	|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	ЗаказКлиентаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ЗаказКлиентаТовары.Упаковка.Наименование КАК НаименованиеУпаковки,
	|	ЗаказКлиентаТовары.Упаковка.Числитель КАК Числитель,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ЗаказКлиентаТовары.Ссылка.Организация.ИНН КАК ОрганизацияИНН,
	|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество
	//|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок * ЗаказКлиентаТовары.Упаковка.Числитель) КАК Количество
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсыЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО РейсыЗаказы.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|ГДЕ
	|	РейсыЗаказы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка.Организация.Наименование,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.Наименование,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ЗаказКлиентаТовары.Номенклатура.Наименование,
	|	ЗаказКлиентаТовары.Номенклатура.Код,
	|	ЗаказКлиентаТовары.Ссылка.Организация.ИНН,
	|	ЗаказКлиентаТовары.Упаковка.Числитель,
	|	ЗаказКлиентаТовары.Упаковка.Наименование
	|ИТОГИ
	|	СУММА(КоличествоУпаковок),
	|	МАКСИМУМ(ОрганизацияИНН),
	|	СУММА(Количество)
	|ПО
	|	Организация,
	|	Родитель");
	Запрос.УстановитьПараметр("Ссылка", СсылкаРейса);
	
	Результат = Запрос.Выполнить();
	
	Возврат СформироватьExcelЧерезМакет(СсылкаРейса, Результат, СсылкаРейса.Номер);
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьExcelИОтправитьSMTP(СсылкаРейса, Получатель) Экспорт
	
	ПолноеИмяФайла = СформироватьФайлExcelПоРейсу(СсылкаРейса);
	
	Тема = СсылкаРейса.ЗонаДоставки.Наименование + " от " + СсылкаРейса.Дата;
	ТекстПисьма = "Во вложении заказ по рейсу " + СсылкаРейса.Номер + Символы.ПС
	+ "От: " + Формат(СсылкаРейса.Номер, "ДЛФ=DD.MM.YY");
	ОтправитьЧерезSMTP(ПолноеИмяФайла, Тема, ТекстПисьма, Получатель);
	
	Возврат ПолноеИмяФайла;
КонецФункции

&НаСервере
Функция СформироватьЗаявкуБезОтправкиНаСервере(СсылкаРейса)
	
	ПолноеИмяФайла = СформироватьФайлExcelПоРейсу(СсылкаРейса);
	
	РейсОбъект = СсылкаРейса.ПолучитьОбъект();
	РейсОбъект.ДатаЛокальногоФормированияЗаявки = ТекущаяДатаСеанса();
	РейсОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаСервереБезКонтекста
Функция Транслит(Имя) Экспорт
   Рез = СокрЛП(Имя);  
   Рез = СтрЗаменить(Рез,"а","a");
   Рез = СтрЗаменить(Рез,"б","b");
   Рез = СтрЗаменить(Рез,"в","v");
   Рез = СтрЗаменить(Рез,"г","g");
   Рез = СтрЗаменить(Рез,"д","d");
   Рез = СтрЗаменить(Рез,"е","e");
   Рез = СтрЗаменить(Рез,"ё","e");
   Рез = СтрЗаменить(Рез,"ж","zh");
   Рез = СтрЗаменить(Рез,"з","z");
   Рез = СтрЗаменить(Рез,"и","i");
   Рез = СтрЗаменить(Рез,"к","k");
   Рез = СтрЗаменить(Рез,"л","l");
   Рез = СтрЗаменить(Рез,"м","m");
   Рез = СтрЗаменить(Рез,"н","n");
   Рез = СтрЗаменить(Рез,"о","o");
   Рез = СтрЗаменить(Рез,"п","p");
   Рез = СтрЗаменить(Рез,"р","r");
   Рез = СтрЗаменить(Рез,"с","s");
   Рез = СтрЗаменить(Рез,"т","t");
   Рез = СтрЗаменить(Рез,"у","u");
   Рез = СтрЗаменить(Рез,"ф","f");
   Рез = СтрЗаменить(Рез,"х","h");
   Рез = СтрЗаменить(Рез,"ч","ch");
   Рез = СтрЗаменить(Рез,"ш","sh");
   Рез = СтрЗаменить(Рез,"щ","sch");
   Рез = СтрЗаменить(Рез,"ъ","");
   Рез = СтрЗаменить(Рез,"ь","");
   Рез = СтрЗаменить(Рез,"э","e");
   Рез = СтрЗаменить(Рез,"ю","yu");
   Рез = СтрЗаменить(Рез,"й","i");
   Рез = СтрЗаменить(Рез,"ц","c");
   Рез = СтрЗаменить(Рез,"я","ya");
   Рез = СтрЗаменить(Рез,"ы","i");
   Рез = СтрЗаменить(Рез,"А","A");
   Рез = СтрЗаменить(Рез,"Б","B");
   Рез = СтрЗаменить(Рез,"В","V");
   Рез = СтрЗаменить(Рез,"Г","G");
   Рез = СтрЗаменить(Рез,"Д","D");
   Рез = СтрЗаменить(Рез,"Е","E");
   Рез = СтрЗаменить(Рез,"Ё","E");
   Рез = СтрЗаменить(Рез,"Ж","ZH");
   Рез = СтрЗаменить(Рез,"З","Z");
   Рез = СтрЗаменить(Рез,"И","I");
   Рез = СтрЗаменить(Рез,"К","K");
   Рез = СтрЗаменить(Рез,"Л","L");
   Рез = СтрЗаменить(Рез,"М","M");
   Рез = СтрЗаменить(Рез,"Н","N");
   Рез = СтрЗаменить(Рез,"О","O");
   Рез = СтрЗаменить(Рез,"П","P");
   Рез = СтрЗаменить(Рез,"Р","R");
   Рез = СтрЗаменить(Рез,"С","S");
   Рез = СтрЗаменить(Рез,"Т","T");
   Рез = СтрЗаменить(Рез,"У","U");
   Рез = СтрЗаменить(Рез,"Ф","F");
   Рез = СтрЗаменить(Рез,"Х","H");
   Рез = СтрЗаменить(Рез,"Ч","CH");
   Рез = СтрЗаменить(Рез,"Ш","SH");
   Рез = СтрЗаменить(Рез,"Щ","SCH");
   Рез = СтрЗаменить(Рез,"Ъ","");
   Рез = СтрЗаменить(Рез,"Ь","");
   Рез = СтрЗаменить(Рез,"Ы","I");
   Рез = СтрЗаменить(Рез,"Ц","C");
   Рез = СтрЗаменить(Рез,"Э","E");
   Рез = СтрЗаменить(Рез,"Ю","YU");
   Рез = СтрЗаменить(Рез,"Я","YA");
   Рез = СтрЗаменить(Рез,"Й","I");
   Возврат(Рез);
КонецФункции

// Формирует файл Excel по макету документа "Рейс" (МакетExcel).
// Требуются области макета: Шапка, Заголовки, Организация, Группа, Строка, ПустаяСтрока
// Параметры в областях (из твоего скрина):
//  Шапка: <Заголовок>
//  Организация: <ИНН>, <Организация>, <ОбщееКоличество>
//  Группа: <Группа>
//  Строка: <Код>, <количество>, <Наименование>, <Заявка>
//
// РезультатЗапроса должен иметь поля:
//  Организация, Родитель, НоменклатураКод, НоменклатураНаименование,
//  ЕдиницаИзмеренияНаименование, Количество
//
// Возвращает полный путь к XLSX (fallback в XLS)
&НаСервереБезКонтекста
Функция СформироватьExcelЧерезМакет(СсылкаРейса, РезультатЗапроса, Дата) Экспорт
	
	КаталогВрем = КаталогВременныхФайлов();
	ИмяОсн      = Транслит(Лев(СсылкаРейса.ЗонаДоставки.Наименование, 6)) + "_" + СсылкаРейса.Номер;
	ФайлXLSX    = КаталогВрем + ИмяОсн + ".xlsx";
	ФайлXLS     = КаталогВрем + ИмяОсн + ".xls";
	
	ТД    = Новый ТабличныйДокумент;
	Макет = Документы.Рейс.ПолучитьМакет("МакетExcel"); // макет документа
	
	// ---- Шапка
	Обл = Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.Заголовок = "Заявка " + Формат(Дата, "ДЛФ=DD.MM.YY");
	ТД.Вывести(Обл);
	
	// ---- Заголовки колонок
	ТД.Вывести(Макет.ПолучитьОбласть("Заголовки"));
	
	// ---- Данные: Партнёр → Группа → Позиции
	ВыбОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	Пока ВыбОрганизация.Следующий() Цикл
		
		// Партнёр
		ОблП = Макет.ПолучитьОбласть("Организация");
		ОблП.Параметры.ИНН= ВыбОрганизация.ОрганизацияИНН; // если нужно ИНН — подставь здесь свою логику
		ОблП.Параметры.Организация = Строка(ВыбОрганизация.Организация);
		//ОблП.Параметры.ОбщееКоличество = ВыбОрганизация.Количество;
		ТД.Вывести(ОблП);
		
		// Группы
		ВыбГруппа = ВыбОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Родитель");
		Пока ВыбГруппа.Следующий() Цикл
			
			ИмяГруппы = ?(ПустаяСтрока(Строка(ВыбГруппа.Родитель)), "(Без группы)", Строка(ВыбГруппа.Родитель));
			ОблГ = Макет.ПолучитьОбласть("Группа");
			ОблГ.Параметры.Группа = ИмяГруппы;
			ТД.Вывести(ОблГ);
			
			// Позиции
			ВыбПоз = ВыбГруппа.Выбрать();
			Пока ВыбПоз.Следующий() Цикл
				ОблСтр = Макет.ПолучитьОбласть("Строка");
				ОблСтр.Параметры.Код = ?(ЗначениеЗаполнено(ВыбПоз.НоменклатураКод), ВыбПоз.НоменклатураКод, "");
				ОблСтр.Параметры.Количество = Формат(ВыбПоз.Количество, "ЧГ=0");
				ОблСтр.Параметры.Наименование = ВыбПоз.НоменклатураНаименование;
				ОблСтр.Параметры.Заявка = Формат(ВыбПоз.КоличествоУпаковок, "ЧГ=0") + " " + ВыбПоз.НаименованиеУпаковки;
				ТД.Вывести(ОблСтр);
			КонецЦикла;
			
			// Пустая строка после группы
			//ТД.Вывести(Макет.ПолучитьОбласть("ПустаяСтрока"));
		КонецЦикла;
		
		// Пустая строка между партнёрами
		ТД.Вывести(Макет.ПолучитьОбласть("ПустаяСтрока"));
	КонецЦикла;
	
	// ---- Сохранение
	Попытка
		ТД.Записать(ФайлXLSX, ТипФайлаТабличногоДокумента.XLSX);
		Возврат ФайлXLSX;
	Исключение
		ТД.Записать(ФайлXLS, ТипФайлаТабличногоДокумента.XLS);
		Возврат ФайлXLS;
	КонецПопытки;
	
КонецФункции

// SMTP: по твоей схеме (ИнтернетПочтовыйПрофиль / ИнтернетПочтовоеСообщение)
&НаСервереБезКонтекста
Процедура ОтправитьЧерезSMTP(ПолноеИмяФайла, Тема, ТекстПисьма, Получатель) Экспорт
	Пользователь	  = "alfa.ooo.zakaz@yandex.ru";
	Пароль		      = "pqliyqdsixipldww";
	Отправитель       = "alfa.ooo.zakaz";
	
	ПараметрыПочты = Новый ИнтернетПочтовыйПрофиль;
	ПараметрыПочты.АдресСервераSMTP = "smtp.yandex.ru";
	ПараметрыПочты.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	ПараметрыПочты.ПользовательSMTP = Пользователь;
	ПараметрыПочты.ПарольSMTP = Пароль;
	ПараметрыПочты.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	ПараметрыПочты.ПортSMTP = 587; 
	
	// Данные IMAP
	ПараметрыПочты.АдресСервераIMAP = "imap.yandex.ru";
	ПараметрыПочты.ИспользоватьSSLIMAP = Истина;
	ПараметрыПочты.ПортIMAP = 993;
	ПараметрыПочты.ПользовательIMAP = Пользователь;
	ПараметрыПочты.ПарольIMAP = Пароль;
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = Тема;
	Текст = Письмо.Тексты.Добавить(ТекстПисьма);
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Письмо.ИмяОтправителя = Отправитель;
	Письмо.Отправитель = Пользователь;
	
	Письмо.Получатели.Добавить(Получатель);
	
	Письмо.Вложения.Добавить(ПолноеИмяФайла);
	
	Подключение = Новый ИнтернетПочта;
	Попытка
		Подключение.Подключиться(ПараметрыПочты);
		Подключение.Послать(Письмо);
		
		Подключение.Подключиться(ПараметрыПочты, ПротоколИнтернетПочты.IMAP);
		//Подключение.ТекущийПочтовыйЯщик = "sent";
		Подключение.Послать(Письмо,, ПротоколИнтернетПочты.IMAP);
	Исключение
		ВызватьИсключение "SMTP: " + ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры

// ===================== СЕРВЕР: запросы =====================

// Заказы, включенные в рейс (ТЧ документа)
&НаСервереБезКонтекста
Функция ЗапросЗаказыРейса(СсылкаРейса) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РЗ.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	Документ.РейсПоставки.Заказы КАК РЗ
	|ГДЕ
	|	РЗ.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СсылкаРейса);
	Возврат Запрос;
КонецФункции

// Диапазон дат выбранных заказов
&НаСервереБезКонтекста
Функция ЗапросДиапазонДат(СписокЗаказов) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИН(ЗК.Дата) КАК ДатаНач,
	|	МАКС(ЗК.Дата) КАК ДатаКон
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗК
	|ГДЕ
	|	ЗК.Ссылка В (&Заказы)");
	Запрос.УстановитьПараметр("Заказы", СписокЗаказов);
	Возврат Запрос;
КонецФункции


&НаКлиенте
Процедура ПечатьПакетаДокументов(Команда)
	
	Если ЭтотОбъект.Модифицированность Тогда
		Сообщить("Сначала запишите рейс."); 
		Возврат;
	КонецЕсли;
	
	
	ТабДокМаршрут = СформироватьТабДокМаршрутногоЛиста(); // твоя функция
	ТабДокМаршрут.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	ТабДокМаршрут.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	
	//// 2) Запросить у сервера, что и в каком виде печатать по всем заказам
	//МассивДоков = СобратьПечатьПоРейсуСервер(Объект.Ссылка);
	//Если МассивДоков = Неопределено ИЛИ МассивДоков.Количество() = 0 Тогда
	//	Сообщить("Нет заказов для печати.");
	//	Возврат;
	//КонецЕсли;
	
	
	Если Объект.Заказы.Количество() = 0 Тогда
		Сообщить("Нет заказов для печати.");
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = МассивЗаказовКлиента(Объект.Ссылка);
	
	НомерСтроки = 1;
	Для каждого Стр из МассивЗаказов Цикл
		ПечатьПакетаПоЗаказу(Стр, НомерСтроки);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция МассивЗаказовКлиента(Рейс)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаДок.Ссылка КАК ЗаказКлиента
		|ИЗ
		|	Документ.Рейс.Заказы КАК РейсЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДок
		|		ПО РейсЗаказы.ЗаказКлиента = ЗаказКлиентаДок.Ссылка
		|		И РейсЗаказы.Ссылка = &Рейс
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента.Номер,
		|	ЗаказКлиента.Дата";
	
	Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЗаказКлиента");
КонецФункции

&НаСервере
Функция СобратьПечатьПоРейсуСервер(СсылкаРейса) Экспорт
	
	Результат = Новый Массив;
	
	// Подтянем строки ТЧ "Заказы" и сами заказы клиентов
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|   Заказы.ЗаказКлиента КАК Заказ
	|ИЗ
	|   Документ.Рейс.Заказы КАК Заказы
	|ГДЕ
	|   Заказы.Ссылка = &Рейс");
	Запрос.УстановитьПараметр("Рейс", СсылкаРейса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивДоков = Новый Массив;
	Пока Выборка.Следующий() Цикл 
		МассивДоков.Добавить(Выборка.Заказ);
	КонецЦикла;
	
	Возврат МассивДоков;
	
КонецФункции

&НаСервере
Функция НужноПечататьПКО(ЗаказКлиента)
	Если ЗаказКлиента.ФормаОплаты = Перечисления.ФормыОплаты.Наличная
		И ЗаказКлиента.ЭтапыГрафикаОплаты.Количество() > 0
		И ЗаказКлиента.ЭтапыГрафикаОплаты[0].Сдвиг = 0 Тогда
		Возврат Истина
	Иначе Возврат Ложь
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПечатьПакетаПоЗаказу(ЗаказКлиента, НомерСтроки)
	
	
	//Поиск данных 
	Если Не ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Сообщить("Не выбран заказ."); Возврат;
	КонецЕсли;
	
	Реализации = НайтиРеализацииПоЗаказуСервер(ЗаказКлиента);
	Если Реализации = Неопределено Или Реализации.Количество() = 0 Тогда
		Сообщить("Нет проведённых Реализаций по этому заказу — печатать нечего.");
		Возврат;
	КонецЕсли;
	
	СФ = НайтиСФПоРТИСервер(Реализации);
	Если СФ = Неопределено Или СФ.Количество() = 0 Тогда
		Сообщить("Нет проведённых СФ по этому заказу — печатать нечего.");
		Возврат;
	КонецЕсли;
	
	
	
	//Блок печати Реализации
	Сп = Новый СписокЗначений;
	Для каждого Стр из Реализации Цикл
		Сп.Добавить(Стр);
	КонецЦикла;
	
	ТабДок = ПолучитьТабДокРеализации(Реализации, Сп, НомерСтроки);
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	
	//Блок печати УПД
	СФДляУПД = Новый Массив;
	Для каждого СФСтр из СФ Цикл
		СФДляУПД.Добавить(СФСтр);
	КонецЦикла;
	
	Если СФДляУПД.Количество() > 0 Тогда
		ПечатьИнтересно(ЭтотОбъект.Элементы.Заказы,  КомандыПечатиСФУПД(), СФДляУПД);
	КонецЕсли;
	
	//Блок печати ПКО
	Если НужноПечататьПКО(ЗаказКлиента) Тогда
		ПКОДляПечати = Новый Массив;
		ПКО = НайтиПКОПоРеализацииСервер(Реализации);
		
		Сп = Новый СписокЗначений;
		Для каждого Стр из ПКО Цикл
			Сп.Добавить(Стр);
		КонецЦикла;
		ТабДок = СформироватьПечатнуюФормуКО1(ПКО, Сп);
		ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	КонецЕсли;
	
	// Повторная печать УПД
	ПечатьИнтересно(ЭтотОбъект.Элементы.Заказы,  КомандыПечатиСФУПД(), СФДляУПД);
	
	// Дополнительные невостребованные печати
	//ПечатьИнтересно(ЭтотОбъект.Элементы.Заказы, КомандыПечатиРтиТорг12(), Реализации);
	//ПечатьИнтересно(ЭтотОбъект.Элементы.Заказы, КомандыПечатиРтиСчетНаОплату(), Реализации);
	//ПечатьИнтересно(ЭтотОбъект.Элементы.Заказы,  КомандыПечатиСФСФ(), СФ);

КонецПроцедуры  

&НаСервере
Функция ПолучитьТабДокРеализации(Реализации, Сп, НомерСтроки)
	ПараметрыПечатиНакладной = Новый Структура;
	ПараметрыПечатиНакладной.Вставить("НомерСтрокиРейс", НомерСтроки);
	Возврат Документы.РеализацияТоваровУслуг.Расш1_СформироватьПечатнуюФормуНакладная(Реализации, Сп, ПараметрыПечатиНакладной);
КонецФункции

Функция СформироватьПечатнуюФормуКО1(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КО1";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриходныйКассовыйОрдер.ПФ_MXL_КО1_ru");
	Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
	
	ИспользуетсяРеглУчет = ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") И НЕ ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ДанныеДокумента.ИсправляемыйДокумент.Дата, ДанныеДокумента.Дата) КАК ДатаДокумента,
	|	ЕСТЬNULL(ДанныеДокумента.ИсправляемыйДокумент.Номер, ДанныеДокумента.Номер) КАК Номер,
	|	ДанныеДокумента.Организация.Наименование КАК НаименованиеОрганизации,
	|	ДанныеДокумента.Организация.НаименованиеСокращенное КАК НаименованиеОрганизацииСокращенное,
	|	ДанныеДокумента.Организация.Префикс КАК Префикс,
	|	ДанныеДокумента.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ВЫБОР 
	|		КОГДА ДанныеДокумента.Валюта = ДанныеДокумента.Организация.ВалютаРегламентированногоУчета
	|			ТОГДА ""50.01""
	|		ИНАЧЕ ""50.21""
	|	КОНЕЦ КАК КодДебета,
	|	ДанныеДокумента.Касса.КассоваяКнига.СтруктурноеПодразделение КАК ПредставлениеПодразделения,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.Контрагент.Представление КАК КонтрагентПредставление,
	|	ДанныеДокумента.ПринятоОт КАК ПринятоОт,
	|	ДанныеДокумента.Основание КАК Основание,
	|	ДанныеДокумента.Приложение КАК Приложение,
	|	ДанныеДокумента.ВТомЧислеНДС КАК ВТомЧисле,
	|	ДанныеДокумента.СуммаДокумента КАК Сумма,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.Валюта.Представление КАК ВалютаПредставление,
	|	ДанныеДокумента.Организация.КодПоОКПО КАК ОрганизацияПоОКПО,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Кассир = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ДанныеДокумента.Автор.ФизическоеЛицо
	|		ИНАЧЕ ДанныеДокумента.Кассир
	|	КОНЕЦ КАК Кассир,
	|	ТаблицаОтветственныеЛица.ГлавныйБухгалтерНаименование КАК ГлавныйБухгалтер,
	|	ДанныеДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеДокумента.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтветственныеЛица КАК ТаблицаОтветственныеЛица
	|		ПО ДанныеДокумента.Ссылка = ТаблицаОтветственныеЛица.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер
	|;";
	
	Если Не ИспользуетсяРеглУчет Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств,
		|	СтатьиДвиженияДенежныхСредств.КорреспондирующийСчет КАК КорСчетКод
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДанныеДокумента.Ссылка КАК Ссылка,
		|		ДанныеДокумента.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
		|	ИЗ
		|		Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
		|	ГДЕ
		|		ДанныеДокумента.Ссылка В(&МассивДокументов)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		РасшифровкаПлатежа.Ссылка,
		|		РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств
		|	ИЗ
		|		Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасшифровкаПлатежа
		|	ГДЕ
		|		РасшифровкаПлатежа.Ссылка В(&МассивДокументов)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
		|		ПО ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств = СтатьиДвиженияДенежныхСредств.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	КорреспондирующийСчет";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОтветственныеЛицаСервер.СформироватьВременнуюТаблицуОтветственныхЛицДокументов(МассивОбъектов, МенеджерВременныхТаблиц);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	
	РеквизитыСторон = ДенежныеСредстваСервер.СведенияОПолучателеПлательщикеПоДокументам(МассивОбъектов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	Выборка           = МассивРезультатов[0].Выбрать();
	КорСчета          = МассивРезультатов[1].Выгрузить();
	
	ПервыйДокумент = Истина;
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, Выборка.Ссылка);
		ОбластьМакета.Параметры.Заполнить(Выборка);
		
		// Наименование сокращенное получателя
		ОтборНаименования = Новый Структура("Документ, Признак", Выборка.Ссылка, 4);
		СведенияОНаименовании = РеквизитыСторон.НайтиСтроки(ОтборНаименования);
		
		Если СведенияОНаименовании.Количество() > 0 Тогда
			ОбластьМакета.Параметры.ПредставлениеОрганизации = СведенияОНаименовании[0].ЗначениеРеквизита;
		Иначе
			ОбластьМакета.Параметры.ПредставлениеОрганизации = Выборка.НаименованиеОрганизации;
		КонецЕсли;
		
		Сумма = Формат(Выборка.Сумма, "ЧДЦ=2");
		Если Выборка.ВалютаРегламентированногоУчета <> Выборка.Валюта Тогда
			Сумма = Сумма + " " + СокрЛП(Выборка.ВалютаПредставление);
		КонецЕсли;
		ОбластьМакета.Параметры.Сумма = Сумма;
		ОбластьМакета.Параметры.СуммаРубКоп = ФормированиеПечатныхФорм.СуммаРубКоп(
			Выборка.Сумма, 
			Выборка.Валюта,	
			Выборка.ВалютаРегламентированногоУчета);
		Если Выборка.Валюта <> Выборка.ВалютаРегламентированногоУчета Тогда
			ОбластьМакета.Параметры.СуммаРубКоп = ОбластьМакета.Параметры.СуммаРубКоп + " " + СокрЛП(Выборка.ВалютаПредставление); 
		КонецЕсли;
		ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалютУТ.СформироватьСуммуПрописью(
			Выборка.Сумма, 
			Выборка.Валюта, 
			Ложь); // ВыводитьСуммуБезКопеек
		ОбластьМакета.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
			Выборка.Номер, 
			Ложь,
			Истина);
		ОбластьМакета.Параметры.СубСчет = КорреспондирующийСчет(Выборка, КорСчета, ИспользуетсяРеглУчет);
		
		Если ПустаяСтрока(Выборка.ВТомЧисле) Тогда
			ОбластьМакета.Параметры.ВТомЧисле = НСтр("ru='без налога (НДС)'", Метаданные.Языки.Русский.КодЯзыка);
		КонецЕсли;
		
		ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = Выборка.ГлавныйБухгалтер;
		ОбластьМакета.Параметры.ФИОКассира = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Выборка.Кассир, Выборка.ДатаДокумента);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент,
			НомерСтрокиНачало,
			ОбъектыПечати,
			Выборка.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция КорреспондирующийСчет(ДанныеДокумента, КорСчета, ИспользуетсяРеглУчет)
	
	Отбор = Новый Структура("Ссылка", ДанныеДокумента.Ссылка);
	КорСчетаДокумента = КорСчета.НайтиСтроки(Отбор);
	Результат = "";
	Для Каждого Счет Из КорСчетаДокумента Цикл
		Результат = Результат + " " + СокрЛП(Счет.КорСчетКод);
	КонецЦикла;
	
	Если Результат = "" И Не ИспользуетсяРеглУчет Тогда
		СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПредопределеннаяСтатьяДДС(ДанныеДокумента.ХозяйственнаяОперация,
																											ДанныеДокумента.Валюта);
		Результат = СтатьяДвиженияДенежныхСредств.КорреспондирующийСчет;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции


Процедура УстановитьПараметр(ОбластьМакета, ИмяПараметра, ЗначениеПараметра)
	ОбластьМакета.Параметры.Заполнить(Новый Структура(ИмяПараметра, ЗначениеПараметра));
КонецПроцедуры


&НаСервере
Функция ЭтоСФОтООО(СФ)
	Возврат СФ.Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо
КонецФункции

&НаКлиенте
Процедура ПечатьИнтересно(Источник, ОписаниеКоманды, Объекты)
	
	ПараметрыВыполнения = Новый Структура;   
	ПараметрыВыполнения.Вставить("ВызовСервераЧерезОбработкуОповещения", Истина);
	ПараметрыВыполнения.Вставить("Источник", Источник);
	ПараметрыВыполнения.Вставить("МассивСсылок", Объекты);
	ПараметрыВыполнения.Вставить("НепроведенныеДокументы", новый Массив);
	ПараметрыВыполнения.Вставить("ОписаниеКоманды", ОписаниеКоманды);
	ПараметрыВыполнения.Вставить("ТребуетсяЗапись", Ложь);
	ПараметрыВыполнения.Вставить("ТребуетсяПроведение", Ложь);
	ПараметрыВыполнения.Вставить("ТребуетсяРаботаСФайлами", Ложь);
	ПараметрыВыполнения.Вставить("Форма",);
	ПараметрыВыполнения.Вставить("ЭтоФормаОбъекта", Ложь);
	ПараметрыВыполнения.ОписаниеКоманды.СразуНаПринтер = Ложь;
	ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры.Вставить("ДвусторонняяПечать", ТипДвустороннейПечати.ПереворотВлево);
	
	УправлениеПечатьюСлужебныйКлиент.ОбработчикКоманды(Объекты, ПараметрыВыполнения);
	
КонецПроцедуры

&НаСервере
Функция КомандыПечатиРтиТорг12() 
	
	СписокКоманд = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.РеализацияТоваровУслуг); 
	Рез = Новый Структура;
	Если СписокКоманд <> Неопределено Тогда 
		Для каждого Колонка из СписокКоманд.Колонки цикл 
			Рез.Вставить(Колонка.Имя, );
		КонецЦикла;
		
		Для Каждого КомандаПеч Из СписокКоманд Цикл
			Если КомандаПеч.Идентификатор = "ТОРГ12" Тогда
				ЗаполнитьЗначенияСвойств(Рез, КомандаПеч);
				Рез.Вставить("Имя", "ПодменюПечатьОбычное__ТОРГ12");
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаСервере
Функция КомандыПечатиРтиСчетНаОплату() 
	
	СписокКоманд = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.РеализацияТоваровУслуг); 
	Рез = Новый Структура;
	Если СписокКоманд <> Неопределено Тогда 
		Для каждого Колонка из СписокКоманд.Колонки цикл 
			Рез.Вставить(Колонка.Имя, );
		КонецЦикла;
		
		Для Каждого КомандаПеч Из СписокКоманд Цикл
			Если КомандаПеч.Идентификатор = "СчетНаОплату" Тогда
				ЗаполнитьЗначенияСвойств(Рез, КомандаПеч);
				Рез.Вставить("Имя", "ПодменюПечатьОбычное__СчетНаОплату"); 
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаСервере
Функция КомандыПечатиСФСФ() 
	
	СписокКоманд = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.СчетФактураВыданный); 
	СФ = Новый Структура;
	Если СписокКоманд <> Неопределено Тогда 
		Для каждого Колонка из СписокКоманд.Колонки цикл 
			СФ.Вставить(Колонка.Имя, );
		КонецЦикла;
		
		Для Каждого КомандаПеч Из СписокКоманд Цикл
			Если КомандаПеч.Идентификатор = "СчетФактура" Тогда
				ЗаполнитьЗначенияСвойств(СФ, КомандаПеч);
				СФ.Вставить("Имя", "ПодменюПечатьОбычное__СчетФактура");
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат СФ;
КонецФункции

&НаСервере
Функция КомандыПечатиСФУПД() 
	
	СписокКоманд = УправлениеПечатью.КомандыПечатиОбъекта(Метаданные.Документы.СчетФактураВыданный); 
	СФ = Новый Структура;
	Если СписокКоманд <> Неопределено Тогда 
		Для каждого Колонка из СписокКоманд.Колонки цикл 
			СФ.Вставить(Колонка.Имя, );
		КонецЦикла;
		
		Для Каждого КомандаПеч Из СписокКоманд Цикл
			Если КомандаПеч.Идентификатор = "УПД" Тогда
				ЗаполнитьЗначенияСвойств(СФ, КомандаПеч);
				СФ.Вставить("Имя", "ПодменюПечатьОбычное__УПД"); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат СФ;
КонецФункции

&НаСервере
Функция НайтиРеализацииПоЗаказуСервер(ЗаказКлиента) Экспорт
	Рез = Новый Массив;
	Если Не ЗначениеЗаполнено(ЗаказКлиента) Тогда 
		Возврат Рез; 
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|   Реал.Ссылка КАК Ссылка
	|ИЗ
	|   Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|   Реал.Проведен
	|   И Реал.ЗаказКлиента = &Заказ");
	Запрос.УстановитьПараметр("Заказ", ЗаказКлиента);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Рез.Добавить(Выб.Ссылка);
	КонецЦикла;
	
	Возврат Рез;
КонецФункции 

&НаСервере
Функция НайтиПКОПоРеализацииСервер(Реализации) Экспорт
	ПКО = Новый Массив;
	Если Не ЗначениеЗаполнено(Реализации) Тогда 
		Возврат ПКО; 
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|   ПКО.Ссылка КАК Ссылка
	|ИЗ
	|   Документ.ПриходныйКассовыйОрдер КАК ПКО
	|ГДЕ
	|   ПКО.Проведен
	|   И ПКО.ДокументОснование В (&Реализации)");
	Запрос.УстановитьПараметр("Реализации", Реализации);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		ПКО.Добавить(Выб.Ссылка);
	КонецЦикла;
	
	Возврат ПКО;
КонецФункции
&НаСервере
Функция НайтиСФПоРТИСервер(РТИ) Экспорт
	СФ = Новый Массив;
	Если Не ЗначениеЗаполнено(РТИ) Тогда 
		Возврат СФ; 
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СФ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СФ
	|ГДЕ
	|	СФ.Проведен
	|	И СФ.ДокументОснование В (&РТИ)");
	Запрос.УстановитьПараметр("РТИ", РТИ);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		СФ.Добавить(Выб.Ссылка);
	КонецЦикла;
	
	Возврат СФ;
КонецФункции

// Собираем данные по рейсу: реализации + реквизиты заказа
&НаСервереБезКонтекста
Функция ПолучитьДоставкиДляМаршрутногоЛиста(СсылкаРейса) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Реализация.Ссылка КАК Реализация,
	|	Реализация.Номер КАК НомерРеализации,
	|	Реализация.Дата КАК ДатаРеализации,
	|	ЕСТЬNULL(Реализация.СуммаДокумента, 0) КАК СуммаДокумента,
	|	ЗаказКлиентаДок.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаДок.Комментарий КАК КомментарийЗаказа,
	|	ЗаказКлиентаДок.Партнер.Наименование КАК Клиент,
	|	ЗаказКлиентаДок.АдресДоставки КАК АдресЗаказа,
	|	ЗаказКлиентаДок.ФормаОплаты КАК ФормаОплаты,
	|	ЗаказКлиентаДок.Партнер.Комментарий КАК ПартнерКомментарий
	|ИЗ
	|	Документ.Рейс.Заказы КАК Рейс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО (Реализация.ЗаказКлиента = Рейс.ЗаказКлиента)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДок
	|		ПО (ЗаказКлиентаДок.Ссылка = Рейс.ЗаказКлиента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контр
	|		ПО (ЗаказКлиентаДок.Контрагент = Контр.Ссылка)
	|ГДЕ
	|	Рейс.Ссылка = &Рейс
	|	И Реализация.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказКлиентаДок.Номер,
	|	ЗаказКлиентаДок.Дата");
	
	Запрос.УстановитьПараметр("Рейс", СсылкаРейса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
КонецФункции

// Сумму прописью (надёжно)
&НаСервереБезКонтекста
Функция СуммаПрописью(Сумма) Экспорт
	Попытка
		Возврат ЧислоПрописью(Сумма, "Л = ru_RU; ДП = Истина", "рубль,рубля,рублей, м,копейка,копейки,копеек, ж,2");
	Исключение
		
		Коп = Сумма * 100 % 100;
		Возврат Формат(Цел(Сумма), "ЧГ=0") + " рублей " + Формат(Коп, "ЧГ=2") + " копеек";
	КонецПопытки;
КонецФункции

Функция МакетМаршрутныйЛист()
	Возврат Документы.Рейс.ПолучитьМакет("МаршрутныйЛист");
КонецФункции

&НаСервере
Функция СформироватьТабДокМаршрутногоЛиста()
	
	// 1) Получаем данные с сервера
	Доставки = ПолучитьДоставкиДляМаршрутногоЛиста(Объект.Ссылка);
	
	Если Доставки.Количество() = 0 Тогда
		ВызватьИсключение("Нет проведённых реализаций по рейсу.");
	КонецЕсли;
	
	// 2) Макет
	Макет = МакетМаршрутныйЛист();
	ТД = Новый ТабличныйДокумент;
	
	// 3) Шапка
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	Заголовок = "Рейс " + Объект.ЗонаДоставки.Наименование + "  Дата рейса " + Формат(Объект.Дата, "ДЛФ=DD.MM.YY");
	ОблШапка.Параметры.Заголовок = Заголовок;
	ТД.Вывести(ОблШапка);
	
	ОблШапкаДоставки = Макет.ПолучитьОбласть("ШапкаДоставки");
	ТД.Вывести(ОблШапкаДоставки);
	
	// 4) Строки доставок
	НомерДоставки = 0;
	СуммаНаличными = 0;
	
	Пока Доставки.Следующий() Цикл
		НомерДоставки = НомерДоставки + 1;
		
		ОблСтр = Макет.ПолучитьОбласть("СтрокаДоставки");
		ОблСтр.Параметры.Номер = НомерДоставки;
		ОблСтр.Параметры.РеалНомерДата = 
		"№ " + Доставки.НомерРеализации + "  " + Формат(Доставки.ДатаРеализации, "ДЛФ=DD.MM.YY");
		ОблСтр.Параметры.Комментарий = Доставки.КомментарийЗаказа;
		ОблСтр.Параметры.Клиент = Доставки.Клиент;
		ОблСтр.Параметры.Адрес = Доставки.АдресЗаказа;
		ОблСтр.Параметры.КомментарийПартнера = Доставки.ПартнерКомментарий;
		ОблСтр.Параметры.Сумма = Формат(Доставки.СуммаДокумента, "ЧГ=0; ЧДЦ=2");
		Если Доставки.ФормаОплаты = Перечисления.ФормыОплаты.Наличная Тогда
			ОблСтр.Параметры.Наличные = Доставки.СуммаДокумента;
		КонецЕсли;
		
		ТД.Вывести(ОблСтр);
		
		Если Доставки.ФормаОплаты = Перечисления.ФормыОплаты.Наличная Тогда
			СуммаНаличными = СуммаНаличными + Доставки.СуммаДокумента;
		КонецЕсли;
	КонецЦикла;
	
	// 5) Итог (сумма наличными и прописью)
	ОблИтог = Макет.ПолучитьОбласть("Итог");
	ОблИтог.Параметры.СуммаНаличными = Формат(СуммаНаличными, "ЧГ=0; ЧДЦ=2");
	ОблИтог.Параметры.СуммаНаличнымиПрописью = СуммаПрописью(СуммаНаличными);
	ТД.Вывести(ОблИтог);
	Возврат ТД;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 ОбновитьПозиции();
	
 КонецПроцедуры
 
&НаСервере
Процедура ОбновитьПозиции()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказКлиентаТовары.Количество КАК Количество
		|ИЗ
		|	Документ.Рейс.Заказы КАК РейсЗаказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО РейсЗаказы.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
		|			И (РейсЗаказы.Ссылка = &Рейс)";
	
	Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Позиции.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаПозиции = Позиции.Добавить();
		СтрокаПозиции.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		СтрокаПозиции.КоличествоШт = ВыборкаДетальныеЗаписи.Количество;
		СтрокаПозиции.КоличествоУпак = ВыборкаДетальныеЗаписи.КоличествоУпаковок;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПриИзменении(Элемент)
	ОбновитьПозиции();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиМаршрутныйЛист(Команда)
	ТабДокМаршрут = СформироватьТабДокМаршрутногоЛиста();
	ТабДокМаршрут.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	ТабДокМаршрут.Показать();
КонецПроцедуры
